<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"3c8862cdfef5789ddb37007ab1a4e5f5b35cdb6cfa8832681e88cd3ea5ef611a","plan_job_ref":"Job .github/workflows/_test-tf.yaml #143 at https://github.com/DND-IT/github-workflows/actions/runs/18790923006","plan_out_hash":"38741dad918fff01417552dd3b699223b6f51c42513b366c5ceaed377acb6db6","plan_hash":"77af22be2bb68ad63920f813ace52ee8dba7e351e906949671719ea1dfd42d95","plan_text_format":"diff","version":"2.2.2"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #143](https://github.com/DND-IT/github-workflows/actions/runs/18790923006)